
# 30915_전종현_0919_6

In [2]:
import pandas as pd
import numpy as np

mpg = pd.read_csv("mpg.csv")
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [13]:
df = pd.DataFrame({"sex":['M','F',None,'F','M'],
                  "score":[5,None,3,1,7]})

In [14]:
df

    sex  score
0     M    5.0
1     F    NaN
2  None    3.0
3     F    1.0
4     M    7.0

In [15]:
pd.isna(df)

     sex  score
0  False  False
1  False   True
2   True  False
3  False  False
4  False  False

In [16]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [24]:
df.dropna(subset=["score"])

    sex  score
0     M    5.0
2  None    3.0
3     F    1.0
4     M    7.0

In [25]:
df_nomiss = df.dropna(subset=['score','sex'])
df_nomiss

  sex  score
0   M    5.0
3   F    1.0
4   M    7.0

In [26]:
df['score'].mean()

4.0

In [27]:
df.groupby("sex").agg(mean_score = ("score","mean"),sum_score = ("score",'sum'))

     mean_score  sum_score
sex
F           1.0        1.0
M           6.0       12.0

In [29]:
exam = pd.read_csv("exam.csv")
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [30]:
# 2 , 4, 7 행 데이터를 Nan 할당 Not a number 오류 숫자가 아닌 값들을 대표하는 오류값

In [32]:
pd.isna(exam['math']).sum()

0

In [34]:
df = pd.DataFrame({"sex":[1,2,1,3,2,1],
                  "score":[5,4,3,4,2,6]})
df

   sex  score
0    1      5
1    2      4
2    1      3
3    3      4
4    2      2
5    1      6